{
  "ir_version": 1,
  "id": "email-digest",
  "name": "Email Digest (grounded narrative)",
  "description": "The digest-then-narrate contract: a deterministic tool computes the inbox facts, the model only PHRASES them, and a judge chain enforces that the narrative neither drops nor invents items. The facts are computed, not generated.",
  "nodes": [
    {"id": "n1", "type": "input", "label": "Inbox request",
     "config": {"schema": "user_question"}, "position": {"x": 40, "y": 140}},
    {"id": "n2", "type": "tool", "label": "Inbox digest",
     "config": {"tool": "email.search", "mode": "sim"},
     "position": {"x": 260, "y": 60}},
    {"id": "n3", "type": "context_assembler", "label": "Assemble digest",
     "config": {"system": "You summarize an inbox digest. Use ONLY the listed messages; never drop, add, or renumber them.",
                "overflow": "error"},
     "position": {"x": 480, "y": 140}},
    {"id": "n4", "type": "prompt_template", "config": {"template": "answer_with_context"},
     "position": {"x": 700, "y": 140}},
    {"id": "n5", "type": "llm", "label": "Narrate",
     "config": {"temperature": 0.2, "max_tokens": 256},
     "position": {"x": 900, "y": 140}},
    {"id": "n6", "type": "judge_chain", "label": "Faithfulness chain",
     "config": {"judges": ["groundedness", "faithfulness"], "retry_budget": 1},
     "position": {"x": 900, "y": 280}},
    {"id": "n7", "type": "audit_log_sink", "label": "Audit ledger",
     "config": {"include": "governance", "format": "jsonl"},
     "position": {"x": 700, "y": 280}},
    {"id": "n8", "type": "output_parser", "config": {"format": "text"},
     "position": {"x": 480, "y": 280}},
    {"id": "n9", "type": "output", "config": {"schema": "answer"},
     "position": {"x": 260, "y": 280}}
  ],
  "edges": [
    {"from": "n1", "to": "n2"},
    {"from": "n1", "to": "n3", "to_port": "question"},
    {"from": "n2", "to": "n3", "to_port": "documents"},
    {"from": "n3", "to": "n4"},
    {"from": "n4", "to": "n5"},
    {"from": "n5", "to": "n6"},
    {"from": "n6", "to": "n7"},
    {"from": "n7", "to": "n8"},
    {"from": "n8", "to": "n9"}
  ],
  "params": {"context_budget_tokens": 6000, "seed": 42, "provider": "sim:helpful-v1"},
  "metadata": {"category": "Agents & Tools",
               "tags": ["intermediate", "email", "grounding", "digest"],
               "origin": "pattern"}
}
