{
  "ir_version": 1,
  "id": "egress-cloud",
  "name": "Egress law: personal content to a cloud model",
  "description": "Minimal two-gate graph — classify, then a cloud model. A tier router in the full spine would downshift personal content and mask the egress contrast, so the egress sweep uses its own tiny graph.",
  "nodes": [
    {"id": "in", "type": "input", "config": {}, "position": {"x": 40, "y": 80}},
    {"id": "classify", "type": "data_classifier", "config": {"egress": "enforce"}, "position": {"x": 240, "y": 80}},
    {"id": "model", "type": "llm", "config": {}, "position": {"x": 440, "y": 80}},
    {"id": "out", "type": "output", "config": {}, "position": {"x": 640, "y": 80}}
  ],
  "edges": [
    {"from": "in", "to": "classify"},
    {"from": "classify", "to": "model"},
    {"from": "model", "to": "out"}
  ],
  "params": {"context_budget_tokens": 4000, "seed": 7, "provider": "anthropic:claude-sonnet-5"}
}
